javascript-init.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>javascript-init</title>
<!-- 2015-02-04 Wed 10:41 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Toby Tripp" />
<link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.2/css/bootstrap.min.css">
<link rel="stylesheet" href="css/htmlize.css">
<link rel="stylesheet" href="css/config.css">
</head>
<body>
<div id="preamble" class="status">
<p><a accesskey="H" href="index.html">HOME</a></p>
</div>
<div id="content">
<h1 class="title">javascript-init</h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Javascript</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Node.js Set-up</h3>
<div class="outline-text-3" id="text-1-1">
<p>
For REPLs and such, because actually writing server-side code in
Javascript is insane.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #f5deb3;">(</span>setenv <span style="color: #2aa198;">"NODE_PATH"</span> <span style="color: #2aa198;">"~/node_modules"</span><span style="color: #f5deb3;">)</span>
<span style="color: #f5deb3;">(</span>setq inferior-js-program-command <span style="color: #2aa198;">"env NODE_NO_READLINE=1 node"</span><span style="color: #f5deb3;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Js-Mode</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #f5deb3;">(</span>require-package 'js-comint<span style="color: #f5deb3;">)</span>

<span style="color: #f5deb3;">(</span><span style="color: #859900; font-weight: bold;">eval-after-load</span> <span style="color: #2aa198;">"js-mode"</span>
  '<span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">progn</span>
     <span style="color: #268bd2;">(</span>add-hook 'js-mode-hook
               <span style="color: #dc322f;">(</span><span style="color: #859900; font-weight: bold;">lambda</span> <span style="color: #cb4b16;">()</span>
                 <span style="color: #cb4b16;">(</span>glasses-mode t<span style="color: #cb4b16;">)</span>
                 <span style="color: #cb4b16;">(</span>setq mode-name <span style="color: #2aa198;">"Js"</span><span style="color: #cb4b16;">)</span><span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span>
     <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">require</span> '<span style="color: #268bd2; font-weight: bold;">js-comint</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span>

<span style="color: #f5deb3;">(</span><span style="color: #859900; font-weight: bold;">defun</span> <span style="color: #268bd2;">jslint-thisfile</span> <span style="color: #b58900;">()</span>
  <span style="color: #b58900;">(</span>interactive<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>compile <span style="color: #268bd2;">(</span>format <span style="color: #2aa198;">"jsl -process %s"</span> <span style="color: #dc322f;">(</span>buffer-file-name<span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #f5deb3;">(</span><span style="color: #859900; font-weight: bold;">provide</span> '<span style="color: #268bd2; font-weight: bold;">javascript-init</span><span style="color: #f5deb3;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Toby Tripp</p>
<p class="date">Created: 2015-02-04 Wed 10:41</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
